#### Terraform Plan (Prod) 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_iam_workload_identity_pool.github_pool: Refreshing state... [id=projects/calendarsync-napier/locations/global/workloadIdentityPools/github-pool]
google_project_service.calendar_api: Refreshing state... [id=calendarsync-napier/calendar-json.googleapis.com]
google_project_service.iam_api: Refreshing state... [id=calendarsync-napier/iam.googleapis.com]
google_project_service.cloudresourcemanager_api: Refreshing state... [id=calendarsync-napier/cloudresourcemanager.googleapis.com]
data.google_project.project: Reading...
google_project_service.firestore_api: Refreshing state... [id=calendarsync-napier/firestore.googleapis.com]
google_project_service.run_api: Refreshing state... [id=calendarsync-napier/run.googleapis.com]
data.google_iam_policy.noauth: Reading...
google_project_service.cloudbuild_api: Refreshing state... [id=calendarsync-napier/cloudbuild.googleapis.com]
google_project_service.secretmanager_api: Refreshing state... [id=calendarsync-napier/secretmanager.googleapis.com]
data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_service_account.github_actions: Refreshing state... [id=projects/calendarsync-napier/serviceAccounts/github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_service.serviceusage_api: Refreshing state... [id=calendarsync-napier/serviceusage.googleapis.com]
google_project_service.iamcredentials_api: Refreshing state... [id=calendarsync-napier/iamcredentials.googleapis.com]
data.google_project.project: Read complete after 1s [id=projects/calendarsync-napier]
google_project_service.artifact_registry_api: Refreshing state... [id=calendarsync-napier/artifactregistry.googleapis.com]
google_project_iam_member.github_actions_service_usage: Refreshing state... [id=calendarsync-napier/roles/serviceusage.serviceUsageAdmin/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.github_actions_editor: Refreshing state... [id=calendarsync-napier/roles/editor/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.github_actions_wif_admin: Refreshing state... [id=calendarsync-napier/roles/iam.workloadIdentityPoolAdmin/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.github_actions_sa_user: Refreshing state... [id=calendarsync-napier/roles/iam.serviceAccountUser/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.github_actions_iam_admin: Refreshing state... [id=calendarsync-napier/roles/resourcemanager.projectIamAdmin/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.github_actions_artifact_registry: Refreshing state... [id=calendarsync-napier/roles/artifactregistry.writer/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_project_iam_member.github_actions_run_admin: Refreshing state... [id=calendarsync-napier/roles/run.admin/serviceAccount:github-actions-sa@calendarsync-napier.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.github_provider: Refreshing state... [id=projects/calendarsync-napier/locations/global/workloadIdentityPools/github-pool/providers/github-provider]
google_project_iam_member.cloudbuild_run_admin: Refreshing state... [id=calendarsync-napier/roles/run.admin/serviceAccount:179450231286@cloudbuild.gserviceaccount.com]
google_service_account_iam_member.github_actions_wif_user: Refreshing state... [id=projects/calendarsync-napier/serviceAccounts/github-actions-sa@calendarsync-napier.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/179450231286/locations/global/workloadIdentityPools/github-pool/attribute.repository/billnapier/calendarsync]
google_firestore_database.default: Refreshing state... [id=projects/calendarsync-napier/databases/(default)]
google_project_service.identitytoolkit_api: Refreshing state... [id=calendarsync-napier/identitytoolkit.googleapis.com]
google_artifact_registry_repository.repo: Refreshing state... [id=projects/calendarsync-napier/locations/us-central1/repositories/python-cloudrun-app]
google_project_service.firebase_api: Refreshing state... [id=calendarsync-napier/firebase.googleapis.com]
google_firebase_project.default: Refreshing state... [id=projects/calendarsync-napier]
google_firebase_web_app.default: Refreshing state... [id=projects/calendarsync-napier/webApps/1:179450231286:web:062abd3c40b3b6a3abefd7]
data.google_firebase_web_app_config.default: Reading...
data.google_firebase_web_app_config.default: Read complete after 0s [id=1:179450231286:web:062abd3c40b3b6a3abefd7]
google_cloud_run_service.default: Refreshing state... [id=locations/us-central1/namespaces/calendarsync-napier/services/python-cloudrun-app]
google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/calendarsync-napier/locations/us-central1/services/python-cloudrun-app]
google_cloud_run_domain_mapping.default: Refreshing state... [id=locations/us-central1/namespaces/calendarsync-napier/domainmappings/calendarsync.billnapier.com]
google_identity_platform_config.default: Refreshing state... [id=projects/calendarsync-napier/config]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # google_cloud_run_service.default has changed
  ~ resource "google_cloud_run_service" "default" {
        id                         = "locations/us-central1/namespaces/calendarsync-napier/services/python-cloudrun-app"
        name                       = "python-cloudrun-app"
      ~ status                     = [
          ~ {
              ~ latest_created_revision_name = "python-cloudrun-app-00018-frs" -> "python-cloudrun-app-00019-g9t"
              ~ latest_ready_revision_name   = "python-cloudrun-app-00018-frs" -> "python-cloudrun-app-00019-g9t"
              ~ observed_generation          = 18 -> 19
              ~ traffic                      = [
                  ~ {
                      ~ revision_name   = "python-cloudrun-app-00018-frs" -> "python-cloudrun-app-00019-g9t"
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (2 unchanged attributes hidden)
            },
        ]
        # (3 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_service.default will be updated in-place
  ~ resource "google_cloud_run_service" "default" {
        id                         = "locations/us-central1/namespaces/calendarsync-napier/services/python-cloudrun-app"
        name                       = "python-cloudrun-app"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
              ~ service_account_name  = "179450231286-compute@developer.gserviceaccount.com" -> (known after apply)
                # (3 unchanged attributes hidden)

              ~ containers {
                    name        = null
                    # (4 unchanged attributes hidden)

                  - env {
                      - name  = "GOOGLE_CLIENT_ID" -> null
                        # (1 unchanged attribute hidden)

                      - value_from {
                          - secret_key_ref {
                              - key  = "1" -> null
                              - name = "google_client_id" -> null
                            }
                        }
                    }
                  - env {
                      - name  = "GOOGLE_CLIENT_SECRET" -> null
                        # (1 unchanged attribute hidden)

                      - value_from {
                          - secret_key_ref {
                              - key  = "1" -> null
                              - name = "google_client_secret" -> null
                            }
                        }
                    }
                  - env {
                      - name  = "SECRET_KEY" -> null
                        # (1 unchanged attribute hidden)

                      - value_from {
                          - secret_key_ref {
                              - key  = "1" -> null
                              - name = "flask_secret_key" -> null
                            }
                        }
                    }
                  + env {
                      + name  = "GCP_REGION"
                      + value = "us-central1"
                    }
                  + env {
                      + name = "GOOGLE_CLIENT_ID"

                      + value_from {
                          + secret_key_ref {
                              + key  = "1"
                              + name = "google_client_id"
                            }
                        }
                    }
                  + env {
                      + name = "GOOGLE_CLIENT_SECRET"

                      + value_from {
                          + secret_key_ref {
                              + key  = "1"
                              + name = "google_client_secret"
                            }
                        }
                    }
                  + env {
                      + name  = "SCHEDULER_INVOKER_EMAIL"
                      + value = (known after apply)
                    }
                  + env {
                      + name = "SECRET_KEY"

                      + value_from {
                          + secret_key_ref {
                              + key  = "1"
                              + name = "flask_secret_key"
                            }
                        }
                    }

                    # (9 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service_iam_member.scheduler_invoker will be created
  + resource "google_cloud_run_service_iam_member" "scheduler_invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = (known after apply)
      + project  = "calendarsync-napier"
      + role     = "roles/run.invoker"
      + service  = "python-cloudrun-app"
    }

  # google_cloud_scheduler_job.sync_all will be created
  + resource "google_cloud_scheduler_job" "sync_all" {
      + description = "Trigger sync for all users"
      + id          = (known after apply)
      + name        = "sync-all-users"
      + paused      = (known after apply)
      + project     = (known after apply)
      + region      = (known after apply)
      + schedule    = "0 * * * *"
      + state       = (known after apply)
      + time_zone   = "Etc/UTC"

      + http_target {
          + http_method = "POST"
          + uri         = "https://python-cloudrun-app-upgl3iqnkq-uc.a.run.app/tasks/sync_all"

          + oidc_token {
              + service_account_email = (known after apply)
            }
        }
    }

  # google_cloud_tasks_queue.sync_queue will be created
  + resource "google_cloud_tasks_queue" "sync_queue" {
      + id       = (known after apply)
      + location = "us-central1"
      + name     = "sync-queue"
      + project  = (known after apply)

      + rate_limits (known after apply)

      + retry_config (known after apply)
    }

  # google_project_iam_member.app_runner_firestore will be created
  + resource "google_project_iam_member" "app_runner_firestore" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "calendarsync-napier"
      + role    = "roles/datastore.user"
    }

  # google_project_iam_member.app_runner_logging will be created
  + resource "google_project_iam_member" "app_runner_logging" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "calendarsync-napier"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.app_runner_secrets will be created
  + resource "google_project_iam_member" "app_runner_secrets" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "calendarsync-napier"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_project_iam_member.cloud_run_tasks_enqueuer will be created
  + resource "google_project_iam_member" "cloud_run_tasks_enqueuer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "calendarsync-napier"
      + role    = "roles/cloudtasks.enqueuer"
    }

  # google_project_service.cloudscheduler_api will be created
  + resource "google_project_service" "cloudscheduler_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "cloudscheduler.googleapis.com"
    }

  # google_project_service.tasks_api will be created
  + resource "google_project_service" "tasks_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "cloudtasks.googleapis.com"
    }

  # google_service_account.app_runner will be created
  + resource "google_service_account" "app_runner" {
      + account_id   = "app-runner"
      + disabled     = false
      + display_name = "Cloud Run Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account.scheduler_invoker will be created
  + resource "google_service_account" "scheduler_invoker" {
      + account_id   = "scheduler-invoker"
      + disabled     = false
      + display_name = "Cloud Scheduler Invoker"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 11 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @billnapier, Action: `pull_request`*